tap "babashka/brew"
tap "clojure-lsp/brew"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/services"
tap "osx-cross/arm"
tap "qmk/qmk"
brew "gmp"
brew "coreutils"
brew "asdf"
brew "bash"
brew "bzip2"
brew "xz"
brew "glib"
brew "clang-format"
brew "cmake"
brew "cppcheck"
brew "cpplint"
brew "direnv"
brew "fd"
brew "gcc"
brew "gdk-pixbuf"
brew "git"
brew "grep"
brew "harfbuzz"
brew "jq"
brew "libgccjit"
brew "librsvg"
brew "libusb"
brew "llvm"
brew "pipx"
brew "poac"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "vcpkg"
brew "wimlib"
brew "zlib"
brew "babashka/brew/neil"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp", "with-retro-sink-bw-icon"]
cask "font-iosevka"
cask "font-iosevka-term-slab-nerd-font"
